app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email_address", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 29 May 2013 21:03:13 UTC +00:00], ["email_address", "hello@hello.com"], ["first_name", "hello"], ["last_name", "hello"], ["updated_at", Wed, 29 May 2013 21:03:13 UTC +00:00]]
---
  def create
    user_params = params.permit(:first_name, :last_name, :email_address, :password)
    @user = User.new(user_params)
    if @user.save